Revit 2027 API
ParameterTypeId.StairsRunWinderBeginWithStraight Property
 "Begin with Straight Run": Winder begin with straight run
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsRunWinderBeginWithStraight { get; }
Public Shared ReadOnly Property StairsRunWinderBeginWithStraight As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsRunWinderBeginWithStraight {
	ForgeTypeId^ get ();
}
static member StairsRunWinderBeginWithStraight : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace